# ForbiddenGroupConstraint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..ForbiddenGroupConstraint Property
BuiltInFailures..::..DimensionFailures Class See Also
---
You may not create sketch or family constraints between group members and elements which are not members of the same group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ForbiddenGroupConstraint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ForbiddenGroupConstraint As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ForbiddenGroupConstraint {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace